#+TITLE: dir-local-hooks
*** dir-locals-set-class-variables
 This is documented as being the way to add to your initrc
 If we set this to work in the ~/ii folder for org-mode, it might
 have the intended effect.
    #+begin_src emacs-lisp
      (dir-locals-set-class-variables
         'tmp-dir
         '((org-mode . (
                   (eval . (message "dir-locals-set-class-variables")
                   )))))

      (dir-locals-set-directory-class
         "/tmp/dir/" 'tmp-dir)
    #+end_src

    #+RESULTS:
    | /tmp/dir/                 | tmp-dir                   | nil                         |
    | /tmp/dir/                 | /tmp/dir/                 | (24027 59785 872210 607000) |
    | /home/hh/ii/org/research/ | /home/hh/ii/org/research/ | (24017 26725 568447 408000) |
    | /home/hh/ii/org/          | /home/hh/ii/org/          | (24017 26725 536447 478000) |
